Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ПараметрыОбщенияСБотом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ПараметрыОбщенияСБотом</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Чат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Чаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_ПараметрыОбщения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ПоследниеСообщенияЧатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ПоследниеСообщенияЧатов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьЭтоВходящее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Чат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Чаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоВходящее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ТриггерыЗапускаСценария.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ТриггерыЗапускаСценария</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЭтапСценария</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_ЭтапыСценария</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыполнитьЭтап</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезОбщенияСБотом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Активный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОписаниеТригера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>АлгоритмПроверки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Алгоритмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сквозной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_СостояниеБота.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_СостояниеБота</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекущийЭтап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_ЭтапыСценария</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвободныйПараметр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаАктивности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Чат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Чаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ПараметрыСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ПараметрыСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Чат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Чаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>IDСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/CommonModules/iga_МетодыРаботыСБотом/Ext/Module.bsl
Процедура ВыполнитьОтправкуФайла(ПараметрыСообщения, АдресРезультата) Экспорт
    
    Результат = Новый Структура;
    Результат.Вставить("Успех", Ложь);
    Результат.Вставить("ТекстОшибки", "");
    
    Попытка
        
        ПутьКФайлу = ПараметрыСообщения.ПутьКФайлу;
		
		Бот = ОБработки.iga_ChatBot.Создать();
		Бот.ИнициализацияОсновныхПараметров();
		
		РезультатОтправки = Бот.ОтправитьВидеоАудиоИзображениеДокумент(ПараметрыСообщения.ИдЧата, 
			ПутьКФайлу, ПараметрыСообщения.Сообщение, ПараметрыСообщения.ИмяФайла);
		
		
        Результат.Успех = Истина;
        
    Исключение
        Информация = ИнформацияОбОшибке();
        Результат.ТекстОшибки = КраткоеПредставлениеОшибки(Информация);
    КонецПопытки;
    
    ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
    
КонецПроцедуры

Процедура ЗагрузитьИсториюСообщений(ДатаНачала, ДатаОкончания) Экспорт
	
	Бот = Обработки.iga_ChatBot.Создать();
	Бот.ИнициализацияОсновныхПараметров();
	
	Бот.ПолучитьИОбработатьСообщенияИзИстории(ДатаНачала, ДатаОкончания);
	
КонецПроцедуры

Процедура УстановитьПараметрОбщения(ЧатСсылка, ИмяПараметра, Значение) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ПараметрыОбщения.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.iga_ПараметрыОбщения КАК iga_ПараметрыОбщения
	               |ГДЕ
	               |	iga_ПараметрыОбщения.ИмяПараметра = &ИмяПараметра";
	Запрос.УстановитьПараметр("ИмяПараметра", СокрЛП(ИмяПараметра));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПараметрСсылка = Выборка.Ссылка;
	Иначе
		ПараметрОбъект = Справочники.iga_ПараметрыОбщения.СоздатьЭлемент();
		ПараметрОбъект.Наименование = ИмяПараметра;
		ПараметрОбъект.ИмяПараметра = СокрЛП(ИмяПараметра);
		ПараметрОбъект.Записать();
		ПараметрСсылка = ПараметрОбъект.Ссылка;
	КонецЕсли;
	
	ЗаписьПараметра = РегистрыСведений.iga_ПараметрыОбщенияСБотом.СоздатьМенеджерЗаписи();
	ЗаписьПараметра.Чат = ЧатСсылка;
	ЗаписьПараметра.Параметр = ПараметрСсылка;
	ЗаписьПараметра.Значение = Значение;
	ЗаписьПараметра.Записать();
	
КонецПроцедуры

Функция ПолучитьЗначениеПараметраОбщения(ЧатСсылка, ИмяПараметра, БазовоеЗначение = "") Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ПараметрыОбщения.Ссылка КАК Ссылка,
	               |	iga_ПараметрыОбщенияСБотом.Значение КАК Значение
	               |ИЗ
	               |	РегистрСведений.iga_ПараметрыОбщенияСБотом КАК iga_ПараметрыОбщенияСБотом
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.iga_ПараметрыОбщения КАК iga_ПараметрыОбщения
	               |		ПО iga_ПараметрыОбщенияСБотом.Параметр = iga_ПараметрыОбщения.Ссылка
	               |ГДЕ
	               |	iga_ПараметрыОбщения.ИмяПараметра ПОДОБНО &ИмяПараметра
	               |	И iga_ПараметрыОбщенияСБотом.Чат = &Чат";
	Запрос.УстановитьПараметр("ИмяПараметра", СокрЛП(ИмяПараметра));
	Запрос.УстановитьПараметр("Чат", ЧатСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	КонецЕсли;
	
	Возврат БазовоеЗначение;
	
КонецФункции

Функция ПолучитьДатуПоследнегоСообщения(ЧатСсылка, ТолькоВходящие = Ложь) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ПоследниеСообщенияЧатов.Чат КАК Чат,
	               |	iga_ПоследниеСообщенияЧатов.ДатаСообщения КАК ДатаСообщения
	               |ИЗ
	               |	РегистрСведений.iga_ПоследниеСообщенияЧатов КАК iga_ПоследниеСообщенияЧатов
	               |ГДЕ
	               |	iga_ПоследниеСообщенияЧатов.Чат = &Чат
	               |	И ВЫБОР
	               |			КОГДА &ТолькоВходящие
	               |				ТОГДА iga_ПоследниеСообщенияЧатов.ЭтоВходящее
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаСообщения УБЫВ";
	Запрос.УстановитьПараметр("Чат", ЧатСсылка);
	Запрос.УстановитьПараметр("ТолькоВходящие", ТолькоВходящие);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДатаСообщения;
	Иначе
		Возврат Дата(1,1,1);
	КонецЕсли;
	
КонецФункции

Функция ПроверитьНомерТелефонаНаВацап(НомерТелефона) Экспорт 
	
	Бот = Обработки.iga_ChatBot.Создать();
	Бот.ИнициализацияОсновныхПараметров();
	Результат = Бот.ПроверитьНаличиеWhatsApp(НомерТелефона);
	
	Если Результат = Неопределено Тогда
		Возврат Новый Структура("Успешно, ТекстОшибки", Ложь, "Ошибка сервиса");
	ИначеЕсли Не Результат.Свойство("existsWhatsapp") Или Не Результат.existsWhatsapp = Истина Тогда
		Возврат Новый Структура("Успешно, ТекстОшибки", Ложь, "Аккаунт по номеру не найден");
	Иначе
		Возврат Новый Структура("Успешно", Истина);
	КонецЕсли;
	
КонецФункции

Функция НайтиЧатПоНомеруТелефона(НомерТелефона) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_Чаты.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.iga_Чаты КАК iga_Чаты
	               |ГДЕ
	               |	iga_Чаты.Идентификатор ПОДОБНО ""%"" + &Идентификатор + ""%""";
	Запрос.УстановитьПараметр("Идентификатор", НомерТелефона);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	
КонецФункции

Функция ЗапускСценарияПоТриггеру(ПараметрыПроверки, Сквозной = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ТриггерыЗапускаСценария.АлгоритмПроверки КАК АлгоритмПроверки,
	               |	iga_ТриггерыЗапускаСценария.ЭтапСценария КАК ЭтапСценария,
	               |	iga_ТриггерыЗапускаСценария.АлгоритмПроверки.ИмяАлгоритма КАК АлгоритмПроверкиИмяАлгоритма,
	               |	iga_ТриггерыЗапускаСценария.ВыполнитьЭтап КАК ВыполнитьЭтап,
	               |	iga_ТриггерыЗапускаСценария.АлгоритмПроверки.Алгоритм КАК АлгоритмПроверкиАлгоритм,
	               |	iga_ТриггерыЗапускаСценария.БезОбщенияСБотом КАК БезОбщенияСБотом
	               |ИЗ
	               |	РегистрСведений.iga_ТриггерыЗапускаСценария КАК iga_ТриггерыЗапускаСценария
	               |ГДЕ
	               |	iga_ТриггерыЗапускаСценария.Сквозной = &Сквозной И Активный";
	Запрос.УстановитьПараметр("Сквозной", Сквозной);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Обработчик = Обработки.iga_ОбработчикЭтапов.Создать();
	ВходящиеПараметры = Новый Структура;
	ВходящиеПараметры.Вставить("Чат", ПараметрыПроверки.ЧатСсылка);
	ВходящиеПараметры.Вставить("ИдЧата", ПараметрыПроверки.ИдЧата);
	ВходящиеПараметры.Вставить("ТекстСообщения", ПараметрыПроверки.ТекстСообщения);
	ВходящиеПараметры.Вставить("ВыборКнопки", ПараметрыПроверки.ВыборКнопки);
	ВходящиеПараметры.Вставить("ТипСообщения", ПараметрыПроверки.ТипСообщения);
	ВходящиеПараметры.Вставить("ИдШаблона", ПараметрыПроверки.ИдШаблона);
	ВходящиеПараметры.Вставить("ИдСообщения", ПараметрыПроверки.ИдСообщения);
	ВходящиеПараметры.Вставить("ИдЦитаты", ПараметрыПроверки.ИдЦитаты);
	
	Обработчик.ВходящиеПараметры = ВходящиеПараметры;
	
	Пока Выборка.Следующий() Цикл
		
		СтекВызовов = Новый Массив;
		
		Попытка
			Выполнен = Обработчик.Алгоритм(Выборка.АлгоритмПроверкиИмяАлгоритма,, СтекВызовов);
		Исключение
			
			СтрокаВызововАлгоритма = СтрСоединить(СтекВызовов, "->");
			
			Инфо = ИнформацияОбОшибке();
			ХешОшибки = iga_ОбщегоНазначенияСервер.ПолучитьКлючОшибки(Инфо);
			
			// Вызов функции записи из предыдущего ответа (с передачей готового Хеша)
			iga_ОбщегоНазначенияСервер.ЗарегистрироватьОшибкуБота(ХешОшибки, "Чат: " + ВходящиеПараметры.Чат + "
			|Стек вызовов: " + СтрокаВызововАлгоритма + Символы.ПС + ПодробноеПредставлениеОшибки(Инфо));
			Выполнен = Ложь;
		КонецПопытки;
		
		Если Выполнен = Истина Тогда
			
			Если Не Выборка.ВыполнитьЭтап Тогда
				ЗаписьСостояния = РегистрыСведений.iga_СостояниеБота.СоздатьМенеджерЗаписи();
				ЗаписьСостояния.Чат = ПараметрыПроверки.ЧатСсылка;
				ЗаписьСостояния.ТекущийЭтап = Выборка.ЭтапСценария;
				ЗаписьСостояния.ДатаАктивности = ТекущаяДата();
				ЗаписьСостояния.Записать();
				
				iga_БотСценарииСервер.ОбработатьВходящееСообщение(ПараметрыПроверки.ЧатСсылка, 
					ПараметрыПроверки.ИдЧата, ПараметрыПроверки.ТекстСообщения, ПараметрыПроверки.ВыборКнопки, Выборка.БезОбщенияСБотом, ВходящиеПараметры);
					
			Иначе
				
				iga_БотСценарииСервер.ВыполнитьОбработчикПередЭтапом(Неопределено, ПараметрыПроверки.ЧатСсылка, 
					ПараметрыПроверки.ИдЧата, Выборка.ЭтапСценария, ПараметрыПроверки.ТекстСообщения, 
					ПараметрыПроверки.ВыборКнопки, ВходящиеПараметры);

				iga_БотСценарииСервер.ВыполнитьЭтап(ПараметрыПроверки.ЧатСсылка, ПараметрыПроверки.ИдЧата,,Выборка.ЭтапСценария, ,Выборка.БезОбщенияСБотом, ВходящиеПараметры);
					
			КонецЕсли;
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Процедура УстановитьПараметрСообщения(Чат, ИдСообщения, ИмяПараметра, Значение) Экспорт
	
	ЗаписьПараметра = РегистрыСведений.iga_ПараметрыСообщений.СоздатьМенеджерЗаписи();
	ЗаписьПараметра.Чат = Чат;
	ЗаписьПараметра.IDСообщения = ИдСообщения;
	ЗаписьПараметра.Параметр = ИмяПараметра;
	ЗаписьПараметра.Значение = Значение;
	ЗаписьПараметра.Записать();
	
КонецПроцедуры

Функция ПолучитьПараметрСообщения(Чат, ИдСообщения, ИмяПараметра) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ПараметрыСообщений.Параметр КАК Параметр,
	               |	iga_ПараметрыСообщений.Значение КАК Значение
	               |ИЗ
	               |	РегистрСведений.iga_ПараметрыСообщений КАК iga_ПараметрыСообщений
	               |ГДЕ
	               |	iga_ПараметрыСообщений.Чат = &Чат
	               |	И iga_ПараметрыСообщений.IDСообщения = &IDСообщения
	               |	И iga_ПараметрыСообщений.Параметр ПОДОБНО &Параметр";
	Запрос.УстановитьПараметр("Чат", Чат);
	Запрос.УстановитьПараметр("IDСообщения", ИдСообщения);
	Запрос.УстановитьПараметр("Параметр", ИмяПараметра);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции
